import to Mu
import to Union
export to República Federativa do Brasil

__________________________________________

"Bitcoin is Love"

ここは私たちのミームの世界、他のみんなはただそこに暮らしてるだけ。

@bitsteinの引用から、私のこの”ミーム”と”世界”の話を始めたいと思う。


私の話は”ミーム”についてではない。まあ、どのみち@bitsteinを超えるような話はできないのだから。

私が話したいのは”ミーム”と”世界”の違いについての話だ。


”ミーム”とは、情報・思考・アイデア。

”ミーム”とは、文化的慣習やアイデアなどの文化的情報の単位であって、ある心から別の心へと、口頭で、もしくは繰り返しの行動によって伝達されるもの。



でも私たちの世界は、ミームではなくてモノでできている。物理法則に従う具体的なモノ。



情報の構造体と物理的な物体は大きく異なっている。ふるまいも大きく違う。そして私たちは、この違いをうまく利用することができる。



地図：現実と関連（もし正確なら）
領土：現実（定義上）

英語では、「地図は領土ではない。(The map is not the territory.)」という言葉がそれをよく表現している。地図に嘘はつけても、現実はその定義上、嘘をつくことができない。



地図は領土ではない。

地図は、領土に似ているかもしれないが、それは常に不完全なものになる。なぜって地図と領土が１体１の関係になるのは、昔も今後も絶対にないのだから。ありえない話なのだ。



「これはパイプではない。」　ルネ・マグリット

芸術家はこれを理解している。哲学者もこれを理解している。私たちも、社会としてこれを理解している。地図は領土ではないし、これはパイプではないのだ。

 

これは銀のドルではない。

余談だが、これは不換紙幣の諸悪の根源でもある。不換紙幣とは、支えとなる現実を持たない地図のようなものだ。その地図は、時間と共に金や銀と言ったそれを支える現実から切り離されてきたのだ。



二重支払問題！

「君がリンゴを１つ持っていて、僕もリンゴを１つ持ってるとして、それを交換したなら、君も僕もリンゴを１つ手にすることになる。でも君がアイデアを１つ持っていて、僕も１つアイデアを持ってるとして、それを交換したなら、各々が２つのアイデアを持つことになるんだ。」

情報とモノの話に戻る。情報は自由に共有することができる。物理的なモノのように、希少価値があるわけでもない。自分のアイデアを失うことなく、アイデアは共有することができる。情報をあるメディアから他のメディアに”移動”させる唯一の方法は、コピーすることしかない。



これはとても重要。なぜならマネーとは情報であるから。

金銭的な情報を表現するには２通りの方法がある。情報をまとめた「台帳」と物質的な「トークン」。「台帳」も「トークン」もどちらも誰が誰に何を借りているかを表すもの。



二重支払問題！
もしかしたら現実を反映してるかも、けど必ずしもそうではない！

物理的なトークンは、それ自体が事実を物語っているが、リスト（台帳）はそうではない。リストには二重支払問題があり、信用を必要とし、取引相手の信用リスクがあり、現実から切り離される可能性がある。物理的なトークンにはこうした問題はない。だからこそ、キャッシュはキングなのだ。



偽造されにくい高価なモノ！
パーミッションレス！

それに加え、物理的トークンは通常、製造するのにコストがかかり、使用するのに許可が不要で、簡単に検証することもできる。しかし、それでも強制的に奪われたり、偽造されたりする問題もある。



地図は現実のスナップショット

根本的な問題はこうだ。いったん現実を情報空間にマッピングしようとすると、現在の世界の状況を”スナップショット”することになる。その地図は常に現実から切り離されている。良く言うなら”スナップショット”、悪く言うなら嘘である。



現実へのリンクが失われる！
参照：ニック・スザボ著”Trusted Third Parties are Security Holes"

現実世界のモノを情報として表現する際には、常にオラクル問題に直面する。つまり、その情報が正確に現実を反映しているかどうか、他の誰かを信用する必要があるのだ。また、現実の世界が変化したらすぐに情報を更新してくれる信用のおける第三者が必要となる。



地図（情報）
領土（物理的物体）

地図と領土を同期させるには、現実の状況が変化した時にすぐに更新される魔法のリストが必要になる。これは通常は中央集権的な仕組みによって解決される。１つのリストが真実のソース。１つの信用の置ける機関がリストを最新の状態に保つことに責任を負う。



ブロックチェーン上のバナナ

これが「ブロックチェーン上のバナナ」がうまくいかない理由である。そしてこれは「ゴールドを担保にした暗号通貨」がうまく行かない理由でもある。どんな物理的な物体も、信頼できる第三者に頼ることなしに「ブロックチェーンに載せる」ことはできないのだ。



これはデジタル・バナナや、デジタル・バナナのハッシュにも同じように言える。物体のハッシュとは指紋なようなもの。その物体そのものとの永久な関係性はない。生まれ持った断絶がそこにはあるのだ。



NFTでもそれは変わらない。君が”所有”しているJPEGは、紛失したり、破損したり、複製されたり、ハッシュ化してまた別のバカに売られたりする。君が所有した何かのハッシュに希少性はないし、ハッシュからだけではそのモノ自体を再現することはできないのだ。君が所有しているのは文字化けした地図であって、領土ではない。



ビットコインはこれを”逆の”方向から解決する。

ビットコインは、情報からスタートしその絶え間ない運用によって自らの現実を作るのだ。



参照："Bitcoin is Time"

ビットコインは地図を定義し、領土を暗示する。全ての参加者が自発的にビットコインを”演じる"ことで、共有された現実が立ち上がる。



ビットコインは(自身の現実を創造する)情報



もちろんビットコインはリンゴを作っているわけではない。ビットコインはブロックを作る。ブロックとは一定のパターンに従った情報の構造体のことだ。このパターンに従うためには、コンピューターによる計算が必要となる。そしてこの計算には、今度は時間とエネルギーが必要となる。



言い換えれば、情報構造体であるビットコインは、そのアウトプットとして有効な台帳エントリを生成するマシン（ビットコインの世界のモーターとでも呼ぼうか）を起動する。



サトシの天才性は、モーターが止まらないようにする難易度調整をそのマシンに埋め込んだことにある。難易度調整が、ビットコイン・システムをオートポイエティック・システム（自己創出・自己維持が可能なシステム）にしている。



これらはすべてProof of Workがエネルギーを必要とするからこそ、正確に機能するのだ。偽造することはできない。議論することもできない。ただで手に入れることもできない。有効なビットコインブロックを見つけるためには、現実の世界で本物の電子をこき使わなければならないのだ。



ビットコインが確率的であることは重要ではない。私たちは、単に情報だけを見て、現実の世界で何が起こったかについて十分に正確な声明が出せるのだ。他には何もいらない。現実は、確率論を利用して情報の中に直接埋め込まれているのだ。



ゆえに：ビットコインにおいて、地図は領土である。

ただ地図を見るだけで、気になることはすべて推測ができる。この数字が表れるためには、この宇宙で一体何が起こらねばならなかったについて、確率的な推論が行える。



これをきちんと理解したなら、きっと頭が吹っ飛ばされるだろう。ただ数字を見ることにより、熱力学の法則、情報、確率論に基づいて、現実世界についての正確な推測をすることができるのだ。



ビットコインとは真実

これにより、ビットコインのタイムチェーンは、過去の出来事について最も真実味のある記録となっている。他のどんな情報も、この問いに対する確実性において、ビットコインに近いものはない。

「それは本当に起こったの？」

この事実があるからこそ、ビットコインは私たちの未来のベースレイヤーになれるのだ。



ここ数年、みんなからの圧倒的なサポートを貰い、私はよく冗談で「ビットコインは愛だ。」と言うようになった。半分冗談だが、もう半分ではもっと深い真実がある。あらゆる交流・相互作用は自発的なものである。そしてそれはそうでなければならない。アイデアとは非暴力なものなのだ。

